<html>
<head>
   <title>SHUTDOWN.EXE - Abschalten per Befehlszeile</title>
</head>
<body>

<br>
Damit der Benutzer auf alle erweiterten Abschaltfunktionen zugreifen kann,
auch wenn das System &uuml;ber die Befehlszeile oder mittels Batch-Datei
geschlossen werden mu&szlig;, wird eine <b>erweiterte Version von SHUTDOWN.EXE</b>
bereitgestellt.
<p>
Die <b>Befehlssyntax</b> ist recht einfach:
<pre>
SHUTDOWN [Befehl] [Optionen]
</pre>
<b>Hinweis:</b><br>
Alle Befehle und Optionen unterscheiden nicht zwischen Gro&szlig;- und
Kleinschreibung. Auch k&ouml;nnen diese mit einem Bindestrich (<tt>-</tt>),
einem Schr&auml;gstrich (<tt>/</tt>) oder ohne Pr&auml;fix eingegeben werden.
Es wird nur der erste Buchstabe ber&uuml;cksichtigt.<br>
SHUTDOWN.EXE, ohne Parameter ausgef&uuml;hrt, f&uuml;hrt einen gew&ouml;hnlichen
Systemabschlu&szlig; durch (entspricht dem Befehl 'C' - siehe unten).
<p>
G&uuml;ltig <b>Befehle</b> sind:
<pre>
[ [ / | - ] ? | D | L | S | C | O | R [:Artikel-Index | VolName ] ]
</pre>
<dl nobreak>
<dt><b>?</b> or <b>H</b></dt>
<dd>zeigt die Kurzanleitung</dd><br>
<dt><b>D</b></dt>
<dd>Zeigt das Dialogfeld zum Herunterfahren an, damit der Benutzer
ausw&auml;hlen kann, welche Art von Systemabschlu&szlig; durchgef&uuml;hrt werden soll.</dd><br>
<dt><b>L</b></dt>
<dd>Sperrt den Desktop und versetzt das System in den Ruhemodus</dd><br>
<dt><b>S</b></dt>
<dd>Versetzt das System in den Ruhemodus</dd><br>
<dt><b>C</b></dt>
<dd>Schlie&szlig;t das System. Die Maschine mu&szlig; manuell ausgeschaltet
oder neu gestartet werden)</dd><br>
<dt><b>O</b></dt>
<dd>Das System ausschalten</dd><br>
<dt><b>R</b></dt>
<dd>Startet das aktuelle Volume neu.<br>
Wenn gefolgt von <b>:n</b> wird das n-te Volume
(beginnend bei 0, wie in der Reboot-Liste angegeben) neu gestartet.<br>
Wenn ein Volume-Name folgt, wird neugestartet und daraufhin das passende
Volume gestartet.</dd><br>
</dl>
Die <b>Optionen</b> sind nur mit den Befehlen <b>C</b>, <b>O</b> oder
<b>R</b> g&uuml;ltig. G&uuml;ltige Optionen sind:
<pre>
[ [ / | - ] E | N ]
</pre>
<dl nobreak>
<dt><b>E</b></dt>
<dd>F&uuml;hrt die &uuml;ber den Notizblock f&uuml;r die Systemabschlu&szlig;-Einstellungen
definierten Programme aus.
</dd><br>
<dt><b>N</b></dt>
<dd>F&uuml;hrt die definierten Programme f&uuml;r den Abschlu&szlig; nicht aus</dd><br>
<dt><b>keine Option angegeben</b></dt>
<dd>Verf&auml;hrt nach den regul&auml;ren Regeln f&uuml;r den Systemabschlu&szlig;.</dd><br>
</dl>
<b>Beispiele:</b>
<p>
<tt>SHUTDOWN /RWIN2000 /N</tt><br>
<tt>SHUTDWON -rWIN2000 -n</tt><br>
<tt>SHUTDOWN rWIN2000 n</tt><br>
<ul compact>
Startet das Volume mit dem Namen "WIN2000" neu,
ohne die definierten Anwendungen f&uuml;r den Abschlu&szlig; auszuf&uuml;hren.
</ul>
<br>
<tt>SHUTDOWN -r:0 -e</tt>
<ul compact>
Startet den ersten Datentr&auml;ger in der Liste der neustartbaren
Datentr&auml;ger neu und f&uuml;hrt die definierten Anwendungen
f&uuml;r den Abschlu&szlig; aus (sofern ein Programm aufgef&uuml;hrt ist).
</ul>
<p>
<br><br><b>R&uuml;ckgabewerte:</b>
<dl nobreak>
<dt>0</dt><dd>Ausf&uuml;hrung erfolgreich.</dd><br>
<dt>2</dt><dd>Fehler: das Handle des Styler-Objektfensters
nicht erhalten.</dd><br>
<dt>4</dt><dd>Fehler: fehlerhafte Parameter</dd><br>
<dt>6</dt><dd>Fehler: Fehler bei der Weitergabe der Anforderung
zum Systemabschlu&szlig; zum Styler-Objektfenster</dd><br>
</dl>
</body>
</html>
