<html>
<head>
   <title>Optionen zum Systemabschlu&szlig;</title>
</head>
<body>

<br>
Der Best&auml;tigungsdialog f&uuml;r den Systemabschlu&szlig; zeigt nur die
ausgew&auml;hlten Optionen an:
<ul>
<li><b>Sperren und Ruhemodus</b> erlaubt es, das Ger&auml;t automatisch
in den Ruhemodus zu versetzen, nachdem der Desktop gesperrt wurde.<br>
Je nach Ger&auml;t kann es notwendig sein, die Maus zu bewegen,
die Leertaste zu dr&uuml;cken oder die Einschalttaste zu bet&auml;tigen,
um den Ruhemodus wieder zu verlassen.<br>
Weitere Informationen und Optionen bez&uuml;glich der Funktion
zum <i>Sperren</i> finden Sie in den Desktop-Eigenschaften.<br><br>
<li><b>Ruhemodus</b> versetzt die Maschine in den Ruhemodus.<br>
Je nach Ger&auml;t kann es notwendig sein, die Maus zu bewegen,
die Leertaste zu dr&uuml;cken oder die Einschalttaste zu bet&auml;tigen,
um den Ruhemodus zu verlassen.<br><br>
<li><b>Abschalten</b> schaltet das Ger&auml;t automatisch ab.<br>
Ungleich der Option zum <i>Systemabschlu&szlig;</i>, verf&uuml;gbar via
Kontextmen&uuml; des <i>Energie</i>-Objekts in den
<i>Systemeinstellungen</i>, erlaubt dar erweiterte
<i>Systemabschlu&szlig;</i> die <a href="sdPrograms.html">Ausf&uuml;hrung</a>
und das <a href="sdTerm.html">automatische Beenden</a>
von vordefinierten Anwendungen. Auch werden die Systemeinstellungen
und der Status der Arbeitsoberfl&auml;che korrekt gespeichert, bevor
die Maschine abgeschalten wird.<br><br>
<li><b>Systemabschlu&szlig;</b> funktioniert genau wie gew&ouml;hnlich,
bietet jedoch die M&ouml;glichkeit, bestimmte Programme
auszuf&uuml;hren und zu beenden, bevor das System abgeschalten wird.<br><br>
<li><b>Neustart</b> erlaubt es, den Rechner direkt neu zu starten,
wobei optional ein anderes Startvolumen gew&auml;hlt werden kann.<br>
Im Gegensatz zu den Neustart-Funktionen, die das Programm
SETBOOT.EXE (im Verzeichnis \OS2) bietet,
speichert die Styler-Neustart-Funktion neben der Ausf&uuml;hrung und dem
Beenden der aufgelisteten Programme alle Systemeinstellungen
und den Desktop-Zustand, bevor der Rechner neu gestartet wird.
</ul>
<b>Hinweis:</b>
<ul compact>
<li>Der Dialog zum Systemabschlu&szlig; erscheint immer dann, wenn der
Benutzer dies &uuml;ber das Desktop-Men&uuml;, das Warp-Center, das eCenter
oder das Launchpad anfordert.
<li><i>Sperren und Ruhemodus</i>, <i>Ruhemodus</i> und
<i>Abschalten</i> funktionieren nur dann, wenn die APM-Unterst&uuml;tzung
in der CONFIG.SYS aktiviert ist, und der OS/2-APM-Treiber
die Hauptplatine des Rechners vollst&auml;ndig unterst&uuml;tzt.
</ul>
<p>
<b>Siehe auch:</b>
<ul compact>
<li><a href="sdGen.html">Allgemeine Optionen zum Systemabschlu&szlig;</a>
<li><a href="sdAdvanced.html">Erweiterte Optionen</a>
<li>Hilfe zu den <a href="commonbtns.html">Schaltfl&auml;chen R&uuml;ckg&auml;ngig und Standard</a>
</ul>
</body>
</html>
