<html>
<head>
   <title>Anwendungen beim Systemabschlu&szlig; ausf&uuml;hren</title>
</head>
<body>

<br>
Der erweiterte Systemabschlu&szlig; erm&ouml;glicht die Ausf&uuml;hrung einer Liste von
Anwendungen bevor das System beendet wird.
<p>
Wenn <b>F&uuml;hren Sie die folgenden Programme beim Systemstart aus</b>
aktiviert ist, werden die unten aufgef&uuml;hrten Anwendungen nacheinander
ausgef&uuml;hrt. Erst wenn die Ausf&uuml;hrung des letzten Programms endet,
werden die zuvor ge&ouml;ffneten Fenster geschlossen und
der Systemabschlu&szlig; durchgef&uuml;hrt.<br>
Wenn die Programmliste leer ist, wird die Option schlicht ignoriert.<br>
<br><b>Hinweis:</b><br>
Der Best&auml;tigungsdialog f&uuml;r den Systemabschlu&szlig; erlaubt es, diese Funktion
&uuml;ber ein Kontrollk&auml;stchen <b>Anwendungen beim Systemabschlu&szlig; ausf&uuml;hren</b>
zeitweise zu deaktivieren oder zu aktivieren.
<p>
Die Programmnamen werden &uuml;ber das Eingabefeld <b>Anwendung</b> eingegeben.<br>
Befindet sich ein Programm im <tt>PATH</tt> (d.h. in einem Verzeichnis, das
in der in der Datei CONFIG.SYS gesetzten Umgebungsvariablen PATH aufgelistet
ist), wird nur der Programmname ben&ouml;tigt, ansonsten ist die Angabe des
vollst&auml;ndigen Programmpfades erforderlich.<br><br>
Wenn keine Erweiterung angegeben wird, wird die Erweiterung .EXE automatisch
an den Programmnamen angeh&auml;ngt.
<br>Wenn es sich bei dem Programm um ein REXX-Skript oder eine
Stapel-CMD-Datei handelt, wird der Name automatisch angepa&szlig;t in:<br>
<tt>CMD.EXE /C Dateiname.cmd Optionen</tt><p>
Wenn die REXX- oder Batch-Datei andere Programme aufruft, mu&szlig; sie dies
synchron tun, d.h. nicht durch einen START- oder DETACH-Befehl, da sonst nicht
erkannt werden kann, wann jedes Programm beendet wird, und einige Dateien
m&ouml;glicherweise nicht richtig gespeichert werden.
<p>
Optionale Programmparameter k&ouml;nnen &uuml;ber das Feld <b>Parameter</b> eingegeben
werden. Dieses Feld mu&szlig; leer gelassen werden, wenn das Programm
keine Parameter ben&ouml;tigt.
<p>
Die Sichtbarkeit des Programms (normal, maximiert oder verdeckt) kann &uuml;ber
die Dropdown-Box <b>Fenster</b> eingestellt werden.
<p>
Die beiden <b>Pfeilschaltfl&auml;chen</b> ordnen den Inhalt der Programmliste an
und verschieben das ausgew&auml;hlte Element nach oben oder unten.<br>
Sie werden bei Bedarf automatisch aktiviert/deaktiviert.
<p>
Mit der Schaltfl&auml;che <b>Hinzuf&uuml;gen</b> wird der Inhalt des aktuellen
Eingabefeldes an das Ende der Liste angef&uuml;gt.
<p>
<b>Entfernen</b> l&ouml;scht das ausgew&auml;hlte Element aus der Liste.
<p>
<b>Bearbeiten</b> f&uuml;llt die Eingabefelder mit den Daten des
ausgew&auml;hlten Elements, damit Sie die &Auml;nderung vornehmen k&ouml;nnen.<br>
Sobald die Daten ge&auml;ndert worden sind, wird die Schaltfl&auml;che
<b>Hinzuf&uuml;gen</b> benutzt, um das gew&auml;hlte Element durch die neuen Daten
zu ersetzen.
<p>
<b>Suchen</b> &ouml;ffnet den Standard-Dateidialog, damit der Benutzer
einen ausf&uuml;hrbaren Dateinamen w&auml;hlen kann.
<p>
<b>Anwenden</b> sichert die Listendaten in der Datei STYLER.INI, w&auml;hrend
<b>R&uuml;ckg&auml;ngig</b> den Listeninhalt in den Zustand zur&uuml;cksetzt, in dem er
sich im Einstellungsnotizbuch befand.
<p>
<b>Siehe auch:</b><br>
Ein <a href="sdProgExample.html">praktisches Beispiel</a> f&uuml;r
die Funktionalit&auml;t der Programmausf&uuml;hrung beim Systemabschlu&szlig;.
</body>
</html>
