<html>
<head>
   <title>Systemabschlu&szlig; - Neustart</title>
</head>
<body>

<br>
&Uuml;ber die Funktion <b>Neustart</b> kann ein Systemabschlu&szlig; durchgef&uuml;hrt,
und dann automatisch auf dem ausgew&auml;hlten Volume neu gestartet werden.
<p>
Unterst&uuml;tzt werden der IBM Boot Manager und Martin Kiewitz's
<a href="sdAiRBOOT.html">AiRBOOT</a>.
<p>
Der Neustart-Dialog erm&ouml;glicht es, die Liste der neu zu startenden
Volumes zu definieren, die &uuml;ber den erweiterten Systemabschlu&szlig;-Dialog
angezeigt werden sollen.<br>
Die Volumenliste kann entweder manuell oder automatisch gef&uuml;llt werden.
<p>
<h3>Manuelles Ausf&uuml;llen</h3><p>
Das Eingabefeld <b>Volume-Name</b> mu&szlig; mit dem Volume-Namen gef&uuml;llt werden,
wie er im BootManager oder AiRBOOT-Men&uuml; erscheint, w&auml;hrend das Feld
<b>Volume-Beschreibung</b> eine ausf&uuml;hrlichere Beschreibung enthalten kann.<br>
Der Best&auml;tigungsdialog zum Systemabschlu&szlig; zeigt in einer Combobox
nur die Volume-Beschreibungen in der Reihenfolge an, in der sie in der
Liste der erlaubten Volumes erscheinen.<br>
Die beiden kleinen <b>Pfeilschaltfl&auml;chen</b> auf der linken Seite der Liste
erlauben Ihnen, die Reihenfolge der Listen-Elemente zu &auml;ndern.
<p>
Die Schaltfl&auml;che <b>Hinzuf&uuml;gen</b> wird aktiviert, sobald die beiden
Eingabefelder Text enthalten. Sobald die Schaltfl&auml;che angeklickt wird,
wird der Feldinhalt am Ende der Liste als hinzugef&uuml;gt:<br>
<tt>Datentr&auml;gerbeschreibung (Datentr&auml;gername)</tt><br>
Mit der Schaltfl&auml;che <b>Entfernen</b> wird ein Element aus der Liste entfernt.
<br>Mit <b>Bearbeiten</b> k&ouml;nnen Sie den Namen oder die Beschreibung
des ausgew&auml;hlten Elements &auml;ndern.
Sobald angeklickt, werden die Daten des ausgew&auml;hlten Listen-Elements in die
Eingabefelder versetzt und die Schaltfl&auml;che <i>Hinzuf&uuml;gen</i> wird aktiviert,
damit der Benutzer des ausgew&auml;hlten Element aktualisieren kann.
<p>
<h3>Automatisches Ausf&uuml;llen</h3><p>
Wenn Sie die Schaltfl&auml;che <b>Suchen</b> bet&auml;tigen, wird die Liste der
startf&auml;higen Partitionen direkt vom Datentr&auml;ger gelesen, wenn AiRBOOT
installiert ist, oder &uuml;ber die LVM-Schnittstelle.<br>
Wenn sich das startf&auml;hige Volume noch nicht in der Liste befindet, wird es mit
folgendem Format an das Ende der Liste angef&uuml;gt:<br>
<tt>Datentr&auml;gername (Datentr&auml;gername)</tt></br>
D.h. der Datentr&auml;gername wird auch als Volumenname verwendet und der Nutzer
mu&szlig; die Schaltfl&auml;che <i>Bearbeiten</i> nutzen, um eine aussagekr&auml;ftigere
Beschreibung zu erhalten.
<p>
<b>Hinweis:</b><br>
Wenn AiRBOOT installiert ist, kann die automatische Erkennung der startf&auml;higen
Volumes fehlschlagen, wenn gerade neue Volumes &uuml;ber das LVM-Programm
hinzugef&uuml;gt oder gel&ouml;scht wurden, da AiRBOOT seine Volume-Tabellen erst nach
einem Neustart aktualisiert.
<p>
<h3>&Uuml;bliche Schaltfl&auml;chen</h3><p>
Mit der Schaltfl&auml;che <b>Anwenden</b> wird die neue Liste in der STYLER.INI
gespeichert.
<p>
<b>R&uuml;ckg&auml;ngig</b> stellt die Liste auf den Zustand zur&uuml;ck, in dem sie sich
befand, als der Einstellungsnotizblock ge&ouml;ffnet wurde.
<p>
<b>Hinweis:</b><br>
Der erweiterte Systemabschlu&szlig;-Dialog w&auml;hlt die Option und das neu zu startende
Volume vor, die beim letzten Mal ausgew&auml;hlt wurden.
</body>
</html>
