<html>
<head>
   <title>Einstellungen Schaltfl&auml;chen</title>
</head>
<body>

<br>
Das Kontrollk&auml;stchen <b>Schaltfl&auml;chen-Erweiterungen</b> steuert,
ob die Schaltfl&auml;chen-Erweiterungen auf das System angewendet werden sollen.
<br>Wenn es markiert ist, sind verschiedene Optionen verf&uuml;gbar, um das Aussehen
aller Schaltfl&auml;chen anzupassen.
<ul>
<li><b>Dicker Rand</b> regelt die Dicke des Randes der Schaltfl&auml;chen.
<br><br><li><b>Flacher Rand</b> l&auml;&szlig;t Schaltfl&auml;chen nicht erh&ouml;ht aussehen.
<br><br><li><b>Nicht-Standardfarben &uuml;bergehen</b> zwingt alle Schaltfl&auml;chen zur
Verwendung der Standard-Schaltfl&auml;chenfarbe und ignoriert dabei vom
Benutzer oder den Programmierern eingestellte Nicht-Standardfarben.
<br><br><li><b>Standardtasten im 3D-Stil</b> &auml;ndert die Betonung der Standardtasten.
Dies sind jene Schaltfl&auml;chen, die aktiviert werden, sobald der Benutzer die
<i>Eingabetaste</i> dr&uuml;ckt.<br>
Von der Standardeinstellung mit 2 Pixeln Volltonfarben zu einer Ein-Pixel
Zwei-Farben Grenze mit einem 3D-Effekt.
<br><br><li><b>Deaktivierte Schaltfl&auml;chen im 3D-Stil</b>
Legt fest, wie deaktivierten Schaltfl&auml;chen angezeigt werden sollen.<br>
Wenn diese Option ausgew&auml;hlt ist, wird der Text der deaktivierten Schaltfl&auml;chen
mit einem 3D-Effekt gezeichnet, andernfalls mit einem grauen Muster &uuml;bermalt.
<br><br><li>Wenn der <b>Vollfarbige Hintergrund</b> f&uuml;r die Schaltfl&auml;che
aktiviert ist, wird der Hintergrund derer als Vollfarbe dargestellt, und
nicht als Bild angezeigt.
<br>
Falls dieses Kontrollk&auml;stchen nicht markiert ist, steht eine weitere
Untergruppe von Steuerelementen zur Verf&uuml;gung, um auszuw&auml;hlen, welches Bild
als Schaltfl&auml;chenhintergrund verwendet werden soll.<br>
Die Dropdown-Liste <b>Hintergrundbild</b> listet die derzeit im Bild-Verzeichnis
des Stylers verf&uuml;gbaren Bilder auf.<br>
Die Schaltfl&auml;che <b>Neues Bild hinzuf&uuml;gen</b> erm&ouml;glicht den Import einer neuen
Bitmap-Datei in das Bildverzeichnis des Stylers.<br>
G&uuml;ltige Bitmap-Dateien sind OS/2-Bitmaps in einem beliebigen Format mit bis zu
256 Farben und weniger als 64 KB.<br>
Wenn es sich bei der Bitmap-Datei um ein Array von Bitmaps handelt, wird nur die
erste Bitmap ber&uuml;cksichtigt.
</ul>
<p>
<b>Siehe auch:</b>
<ul compact>
<li>Notizbuch f&uuml;r Benutzeroberfl&auml;cheneinstellungen -
<a href="uiGen.html">Deckblatt</a>
<li>Hilfe zu den Schaltfl&auml;chen <a href="commonbtns.html">Anwenden, R&uuml;ckg&auml;ngig,
Standard, Vorschau</a>
</ul>
</body>
</html>
