<html>
<head>
   <title>Styler - Verbesserungen der Benutzeroberfl&auml;che</title>
</head>
<body>

<br>
<b>Styler</b> verbessert sowohl die &Auml;sthetik als auch das Verhalten einiger
Bedienelemente des OS/2 Pr&auml;sentations-Manager und des Systems im allgemeinen.
<p>
Das Objekt <b>Benutzeroberfl&auml;che</b> steuert das Aussehen der Titelleisten
und Schaltfl&auml;chen, sowie die von den Dialogfenstern verwendete Schriftart.
<p>
Anwender, die den Warp-4-Stil bevorzugen, k&ouml;nnen das Kontrollk&auml;stchen
<b>Erweiterungen der Benutzeroberfl&auml;che aktivieren</b> abw&auml;hlen, oder die
Titelleiste, die Schaltfl&auml;che oder die Dialog-Erweiterungen
partiell deaktivieren.
<p>
Dar&uuml;ber hinaus kann das von Styler bereitgestellte erweiterte Aussehen f&uuml;r
einen bestimmten Satz von Anwendungen selektiv deaktiviert werden.<br>
Verwenden Sie das Eingabefeld &uuml;ber den Schaltfl&auml;chen <i>Hinzuf&uuml;gen</i>,
<i>Entfernen</i> und <i>Finden</i>, um den Namen einer ausf&uuml;hrbaren
Datei anzugeben, und dann die Schaltfl&auml;che <b>Hinzuf&uuml;gen</b>, um den
neuen Eintrag zur Liste hinzuzuf&uuml;gen.<br>
Mit der Schaltfl&auml;che <b>Entfernen</b> werden die ausgew&auml;hlten Eintr&auml;ge
aus der Liste entfernt.
<br>
Die Schaltfl&auml;che <b>Suchen</b> zeigt den Standard-Dateidialog an und
erlaubt es Ihnen, den gew&auml;hlten Dateinamen direkt zur Liste hinzuzuf&uuml;gen.
<p>
Sobald die Liste ge&auml;ndert wurde, wird die Schaltfl&auml;che <b>Anwenden</b>
aktiviert. Diese speichert die neuen Eintr&auml;ge und informiert den Styler,
da&szlig; &Auml;nderungen gemacht wurden.
<p>
<b>Hinweis:</b><br>
Die Aktivierung/Deaktivierung der Oberfl&auml;chenverbesserungen wird durchgef&uuml;hrt,
sobald der Zustand des Kontrollk&auml;stchens ge&auml;ndert wird: Es ist nicht
erforderlich, die Schaltfl&auml;che <i>Anwenden</i> zu diesem Zweck zu verwenden.
<p>
Die Dokumentation zu den <a href="commonbtns.html">&uuml;blichen Schaltfl&auml;chen</a>
bietet einige weitere Informationen &uuml;ber die Schaltfl&auml;che <i>Anwenden</i>
und die anderen Schaltfl&auml;chen, die im Bereich <i>Allgemeine Schaltfl&auml;chen</i>
des Einstellungsnotizblocks angezeigt werden.
</body>
</html>
